{
    "books": [
      {
        "bookId": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.ibb.co.com/XbhSSsm/1682525976411-removebg-preview.png",
        "review": "An intense psychological thriller that keeps readers guessing until the very end. The story follows Alicia Berenson, a famous painter who shoots her husband and then refuses to speak another word. The novel explores themes of trauma, silence, and betrayal, with a stunning final twist that changes everything.",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Thriller",
        "tags": ["Suspense", "Psychological"],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
      },
      {
        "bookId": 2,
        "bookName": "Educated",
        "author": "Tara Westover",
        "image": "https://i.ibb.co.com/jhFKtYK/educated.png",
        "review": "Tara Westover's memoir is a moving, powerful narrative of growing up in a survivalist family in rural Idaho. She had no formal education until the age of 17, but eventually escapes to pursue an education at some of the most prestigious universities in the world. It's an inspiring story about the transformative power of education and self-discovery.",
        "totalPages": 334,
        "rating": 4.7,
        "category": "Memoir",
        "tags": ["Inspiration", "Resilience"],
        "publisher": "Random House",
        "yearOfPublishing": 2018
      },
      {
        "bookId": 3,
        "bookName": "Atomic Habits",
        "author": "James Clear",
        "image": "https://i.ibb.co.com/qmbMKdx/6625230d9bf16dc9d066b31a-Atomic-Habits-by-James-Clear-removebg-preview.png",
        "review": "In this insightful book, James Clear explores how small habits, when consistently followed, can lead to significant personal and professional transformations. Using clear strategies, backed by scientific research, he demonstrates how to break bad habits and build good ones, making lasting change more achievable for anyone willing to commit.",
        "totalPages": 320,
        "rating": 4.8,
        "category": "Self-help",
        "tags": ["Productivity", "Motivation"],
        "publisher": "Avery",
        "yearOfPublishing": 2018
      },
      {
        "bookId": 4,
        "bookName": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "image": "https://i.ibb.co.com/3Rn7fZR/wherethecrawdadssing-removebg-preview.png",
        "review": "This beautifully written novel combines a poignant coming-of-age story with a gripping murder mystery. Set in the marshlands of North Carolina, it follows Kya, a young girl abandoned by her family, as she grows up in isolation. The novel explores themes of loneliness, survival, and the human need for connection, all while building suspense as a local murder draws Kya into the spotlight.",
        "totalPages": 384,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Nature", "Mystery"],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
      },
      {
        "bookId": 5,
        "bookName": "Becoming",
        "author": "Michelle Obama",
        "image": "https://i.ibb.co.com/Xs3spnf/images-removebg-preview.png",
        "review": "Michelle Obama’s memoir is a candid and inspiring look at her life, from her childhood in Chicago to her time as First Lady. It offers an intimate view of her struggles and triumphs, from navigating life in the White House to balancing motherhood and public service. Her resilience, grace, and unwavering commitment to making a difference shine through every page.",
        "totalPages": 448,
        "rating": 4.9,
        "category": "Biography",
        "tags": ["Inspiration", "Leadership"],
        "publisher": "Crown",
        "yearOfPublishing": 2018
      },
      {
        "bookId": 6,
        "bookName": "Sapiens: A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "image": "https://i.ibb.co.com/R2DzVQ2/98-2bd270f7-2ce6-4308-98e8-0392dcb97809-removebg-preview.png",
        "review": "Harari's sweeping history of humankind explores the development of our species, from the earliest days of Homo sapiens to the modern age. It tackles complex themes like the impact of agriculture, the rise of empires, and the future of humanity in the face of technological change. This thought-provoking book will change the way you view human history and the world around us.",
        "totalPages": 464,
        "rating": 4.7,
        "category": "History",
        "tags": ["Anthropology", "Evolution"],
        "publisher": "Harper",
        "yearOfPublishing": 2015
      },
      {
        "bookId": 7,
        "bookName": "The Power of Habit",
        "author": "Charles Duhigg",
        "image": "https://i.ibb.co.com/LdLXJjG/Featured-TPOH-Book-1200x628-removebg-preview.png",
        "review": "Charles Duhigg takes a deep dive into the science of habits and their power to shape our lives, both personally and professionally. He explores how habits are formed, how they can be changed, and how companies and individuals can harness the power of habits to achieve success. A fascinating look at human behavior, packed with useful insights and practical advice.",
        "totalPages": 400,
        "rating": 4.4,
        "category": "Self-help",
        "tags": ["Behavior", "Change"],
        "publisher": "Random House",
        "yearOfPublishing": 2012
      },
      {
        "bookId": 8,
        "bookName": "The Midnight Library",
        "author": "Matt Haig",
        "image": "https://i.ibb.co.com/g4Ym5qp/canongate-20-1-213233b-1000x0-removebg-preview.png",
        "review": "This imaginative novel explores the infinite possibilities of life through the lens of Nora Seed, a woman who finds herself in a library between life and death. Each book on the shelves represents a different version of her life, had she made different choices. It's a deeply reflective story about regrets, hope, and the choices that define who we are.",
        "totalPages": 304,
        "rating": 4.2,
        "category": "Fiction",
        "tags": ["Philosophy", "Fantasy"],
        "publisher": "Canongate Books",
        "yearOfPublishing": 2020
      },
      {
        "bookId": 9,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co.com/nmnR82t/9789389053739-fr-removebg-preview.png",
        "review": "Orwell’s classic dystopian novel paints a terrifying vision of a totalitarian regime that controls every aspect of life. The novel is a chilling exploration of power, truth, and surveillance, with its warnings about the dangers of unchecked authority and the erasure of personal freedom still resonating strongly today.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Dystopian",
        "tags": ["Politics", "Totalitarianism"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
      },
      {
        "bookId": 10,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "catcher_in_the_rye.jpg",
        "review": "Salinger’s iconic novel explores the confusion and alienation of adolescence through the eyes of Holden Caulfield, a disillusioned teenager struggling to find his place in the world. Written in a conversational, first-person style, the novel captures the essence of teenage rebellion and angst, making it a beloved classic for generations of readers.",
        "totalPages": 214,
        "rating": 4.0,
        "category": "Fiction",
        "tags": ["Classic", "Youth"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
      },
      {
        "bookId": 11,
        "bookName": "The Subtle Art of Not Giving a F*ck",
        "author": "Mark Manson",
        "image": "subtle_art.jpg",
        "review": "Mark Manson delivers a refreshingly honest take on self-improvement, arguing that life’s struggles are what give it meaning. By shifting focus from relentless positivity to embracing life’s difficulties, Manson challenges readers to redefine what’s important and take control of their own happiness. A bold, no-nonsense guide for anyone seeking a more authentic life.",
        "totalPages": 224,
        "rating": 4.3,
        "category": "Self-help",
        "tags": ["Mindset", "Honesty"],
        "publisher": "Harper",
        "yearOfPublishing": 2016
      },
      {
        "bookId": 12,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "great_gatsby.jpg",
        "review": "Fitzgerald’s magnum opus is a beautifully written exploration of wealth, love, and the elusive American Dream. Set during the Jazz Age, it tells the tragic story of Jay Gatsby, a self-made millionaire, and his obsession with the beautiful Daisy Buchanan. The novel’s timeless themes and lyrical prose have made it a literary masterpiece that continues to captivate readers today.",
        "totalPages": 180,
        "rating": 4.4,
        "category": "Classic",
        "tags": ["Romance", "Wealth"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
      }
    ]
  }
  